Revit 2026 API

# SpaceCalculatedSupplyAirflow Property

---

Get the Calculated Supply Airflow of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CalculatedSupplyAirflow { get; }
```
```vb
Public ReadOnly Property CalculatedSupplyAirflow As Double
	Get
```
```cpp
public:
property double CalculatedSupplyAirflow {
	double get ();
}
```
```fsharp
member CalculatedSupplyAirflow : float with get
```

#### Property Value

Double

This property is used to get the Calculated Supply Airflow (Unit: CFM) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace